eisup_2019_docmng_integration/src/InformationRegisters/абс_РуководителиБлока/абс_РуководителиБлока.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_РуководителиБлока</name>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_РуководителиБлока/ManagerModule.bsl
Функция ПользовательЯвляетсяРуководителемБлока(ЦФО,Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИСТИНА КАК РуководительБлока
	|ИЗ
	|	РегистрСведений.абс_РуководителиБлока КАК абс_РуководителиБлока
	|ГДЕ
	|	абс_РуководителиБлока.ЦФО = &ЦФО
	|	И абс_РуководителиБлока.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ЦФО", ЦФО);
	
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи.Следующий();
	
КонецФункции
